Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (1, None, 64)             166848    
_________________________________________________________________
lstm (LSTM)                  (1, None, 640)            1804800   
_________________________________________________________________
dense (Dense)                (1, None, 2607)           1671087   
=================================================================
Total params: 3,642,735
Trainable params: 3,642,735
Non-trainable params: 0
_________________________________________________________________
