Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, None, 50)          130350    
_________________________________________________________________
lstm (LSTM)                  (None, None, 700)         2102800   
_________________________________________________________________
dense (Dense)                (None, None, 2607)        1827507   
=================================================================
Total params: 4,060,657
Trainable params: 4,060,657
Non-trainable params: 0
_________________________________________________________________
