Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (1, None, 32)             3328      
_________________________________________________________________
lstm (LSTM)                  (1, None, 512)            1116160   
_________________________________________________________________
dense (Dense)                (1, None, 104)            53352     
=================================================================
Total params: 1,172,840
Trainable params: 1,172,840
Non-trainable params: 0
_________________________________________________________________
