Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (1, None, 256)            667392    
_________________________________________________________________
lstm (LSTM)                  (1, None, 768)            3148800   
_________________________________________________________________
dense (Dense)                (1, None, 2607)           2004783   
=================================================================
Total params: 5,820,975
Trainable params: 5,820,975
Non-trainable params: 0
_________________________________________________________________
