Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (1, None, 64)             166848    
_________________________________________________________________
lstm (LSTM)                  (1, None, 512)            1181696   
_________________________________________________________________
dense (Dense)                (1, None, 2607)           1337391   
=================================================================
Total params: 2,685,935
Trainable params: 2,685,935
Non-trainable params: 0
_________________________________________________________________
